import 'package:flutter/material.dart';

class Friday extends StatelessWidget {
  const Friday({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('ውዳሴ ማርያም ዘዓርብ')),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: WidaseMaryamContent(),
      ),
    );
  }
}

class WidaseMaryamContent extends StatelessWidget {
  const WidaseMaryamContent({super.key});

  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        ExpansionTile(
          title: Text('1. ዉዳሴ ማርያም ዘዓርብ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
ውዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ አምላክ ዘይትነበብ
በዕለተ ዓርብ።
1. ቡርክት አንቲ እምአንስት ወቡሩክ ፍሬ ከርሥኪ፡ ኦ ማርያም
ድንግል ወላዲተ አምላክ ዘእንበለ ርኩስ ሠረቀ ለነ እምኔኪ ፀሐየ
ጽድቅ፡ ወአቅረበነ ታሕተ ክነፍሁ እስመ ዉእቱ ፈጠረነ፡ ሰአሊ ለነ
ቅድስት።
               '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('2. ለኪ ለባሕቲትኪ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 2. ለኪ ለባሕቲትኪ ኦ እግዚእትነ ወላዲተ አምላክ እመ ብርሃን አንቲ
ናዐብየኪ በስብሐት ወበዉዳሴ።

- ቡርክት አንቲ ተዐቢዪ እምሰማይ ወትከብርይ እምድር ወላዕለ
ኩሉ ሕሊናት፡ መኑ ዘይክል ነቢበ ዕበየኪ፡ ወአልቦ ዘይመስል
ኪያኪ፡ ኦ ማርያም መላእክት ያዐብዩኪ ወሱራፌል
ይሴብሑኪ፡ እስመ ዘይነብር ዲበ ኪሩቤል ወሱራፌል መጽአ
ወኀደረ ዉስተ ከርሥኪ፡ መፍቀሬ ሰብእ አቅረበነ ኀቤሁ፡
ዘዚአነ ሞተ ነሥአ ወእንቲአሁ ሕይወተ ወሀበነ፡ ዘሎቱ ክብር
ወስብሐት፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('3. ምክሖን'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 3. ቡርክት አንቲ ማርያም ወቡሩክ ፍሬ ከርሥኪ ኦ ድንግል ወላዲተ አምላክ
ምክሖን ለደናግል፡ ዘእምቅድመ ዓለም ህልዉ ተሰብአ እምኔኪ ብሉየ መዋዕል
ወፅአ እምከርስኪ ሥጋነ ነሥአ ወመንፈሶ ቅዱሰ ሀቤነ፡ ወረሰየነ ዕሩያነ ምስሌሁ
በብዝኃ ኂሩቱ፡ አንቲ ተዐቢዪ እምብዙኃት አንስት እለ ነሥአ ጸጋ ወክብረ፡ ኦ
ማርያም ወላዲተ አምላክ ሀገር መንፈሳዊት ዘኀደረ ላዕሌሃ እግዚአብሔር ልዑል፡
እስመ ዘይነብር ዲበ ኪሩቤል ወሱራፌል በእራኅኪ ሐቀፍኪዮ፡ ወዘይሴሲ ለኩሉ
ዘሥጋ በብዝኃ ኂሩቱ አኀዘ አጥባተኪ ወጠበወ ሕሊበ፡ ዘዉእቱ አምላክነ መድኃኔ
ኩሉ ይርዕየነ እስከ ለዓለም፡ ንስግድ ሎቱ ወንሰብሖ እስመ ዉእቱ ፈጠረነ፡
ሰአሊለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('4. ሙዳየ ዕፍረት'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 4. ማርያም ድንግል ሙዳየ ዕፍረት ነቅዐ ፈልፈለ ማየ
ሕይወት፡ፍሬ ከርሣ አድኃነ ኩሎ ዓለመ ወሠዐረ እምኔነ
መርገመ፡ ወገብረ ሰላመ ማእከሌነ በመስቀሉ ወበትንሣኤሁ
ቅድስት፡ አግብኦ ለብእሲ ዳግመ ዉስተ ገነት፡ ሰአሊለነ ቅድስት።
                '''),
            ),
          ],
        ),

        ExpansionTile(
          title: Text('5. ንጽሕት '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
5. ማርያም ንጽሕት ድንግል ወላዲተ አምላክ ማእምንት፡
ሰአሊተ ምሕረት ለዉሉደ ሰብእ ሰአሊ ለነ ኀበ ክርስቶስ
ወልድኪ ይሥረይ ኃጢአተነ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('6. ትጸርሕ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
6. ማርያም ድንግል ትጸርሕ በቤተ መቅደስ ወትብል የአምር
እግዚአብሔር ከመ አልብየ ዘአአምር ባዕደ ወኢምንትኒ ዘእንበለ
ድምፀ ቃሉ ለመልአክ ዘአብሠረኒ በክብር፡ ወይበለኒ ሰላም ለኪ ኦ
ቅድስት ድንግል፡ ፆርኪ ዘኢይትፀወር፡ አግመርኪ ዘይትገመር
ወአልቦ ዘያገምሮ ምንትኒ፡ ይበዝኅ ዉዳሴኪ ኦ ምልእተ ጸጋ በኩሉ
ክብር፡ እስመ ኮንኪ አንቲ ማሕደረ ቃለ አብ፡አንቲ ዉእቱ
መንጦላዕት ስፍህት እንተ ታስተጋብኦሙ ለመሃይምናን ሕዝበ
ክርስቲያን ወትሜህሮሙ ሰጊደ ለሥሉስ ማሕየዊ፡

- አንቲ ዉእቱ ዘፆርኪ ዓምደ እሳት ዘርእየ ሙሴ ዘዉእቱ ወልደ
እግዚአብሔር መጽአ ወኀደረ ዉስተ ከርሥኪ፡ ኮንኪ ታቦቶ
ለፈጣሬ ሰማያት ወምድር፡ ፆርኪዮ በከርሥኪ ፱ተ አዉራኃ፡
አንቲ ማእምንት ለዘኢያገምርዎ ሰማያት ወምድር፡ ኮንኪ
ተንከተመ ለዕርገት ዉስተ ሰማይ፡ ብርሃንኪ የዐቢ እምብርሃነ
ፀሐይ፡ አንቲ ዉእቱ ምስራቅ ዘወፅአ እምኔኪ ኮከብ ብሩህ
ዘነፀርዎ ቅድሳን በፍሥሓ ወበኃሤት፡

- ዘፈትሐ ላዕለ ሔዋን ትለድ በፃዕር ወሕማም፡ አንቲሰ ማርያም
ሰማዕኪ ዘይብል ተፈሥሒ ኦ ምልእተ ጸጋ፡ ወለድኪ ለነ
ንጉሠ እግዚአ ኩሉ ፍጥረት መጽአ ወአድኀነነ መሐሪ ዉእቱ
ወመፍቀሬ ሰብእ፡ በእንተዝ ንዌድሰኪ በከመ ገብርኤል
መልአክ እንዘ ንብል፡ ቡርክት አንቲ ማርያም ወቡሩክ ፍሬ
ከርሥኪ ተፈሥሒ ኦ ምልእተ ጸጋ እግዚአብሔር ምስሌኪ
ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
      ],
    );
  }
}
