import 'package:flutter/material.dart';

class Anqetse_Birhan extends StatelessWidget {
  const Anqetse_Birhan({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('አንቀጸ ብርሃን')),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: WidaseMaryamContent(),
      ),
    );
  }
}

class WidaseMaryamContent extends StatelessWidget {
  const WidaseMaryamContent({super.key});

  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        ExpansionTile(
          title: Text('1. አንቀጸ ብርሃን'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
1. ዉዳሴ ወግናይ ለእመ አዶናይ፡ ቅድስት ወብፅዕት፡ ስብሕት ወቡርክት፡
ክብርት ወልዕልት ዐንቀጸ ብርሃን፡ መዓርገ ሕይወት ወማኅደረ መለኮት
ቅድስተ ቅዱሳን፡ አንቲ ዉእቱ ኦ እግዚትነ ወላዲተ ኣምላክ ማርያም
ድንግል፡ ተሰመይኪ ሥምረተ አብ ወማኅደረ ወልድ፡ ወምጽላለ ዘቅዱስ
መንፈስ፡ ኦ ብርክት እምክሉ ፍጥረት፡ አንቲ ዉእቱ ህየንተ አርያም
ዘበሰማያት ዘኮንኪ አርያመ በዲበ ምድር፡ ብኪ አስተማሰሉ ቅዱሳን
ነቢያት፡ ካህናት ወነገሥት፡ ገብሩ ሎሙ ቅድስተ ቅዱሳን፡ ወዉስቴታ
ጽላተ ኪዳን፡ ወልድኪ ሣህሎ ይክፍለነ፡ ሰአሊ ለነ ቅድስት።
               '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('2. ዐሠርቱ ቃላት'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
2. በእንተ ተሠግዎቱ ለወልደ አምላክ እምኔኪ፡ ወብኪ ቅሩባነ
ኮነ። ዐሠርቱ ቃላት እለ ተጽሕፋ በአፃብዒሁ ለእግዚአ ኩሉ
ፍጥረት፡ ኀደረ ወልደ አምላክ ላዕሌኪ አብ በየማኑ ከደነኪ
ወቅዱስ መንፈስ ጸለለኪ ወኃይለ ልዕል አጽንዐኪ፡ ወኢየሱስ
ለብሰ ሥጋ ዚአኪ ከልሐ ወይቤ፡ ዘጸምአ ይምጻእ ኀቤየ
ወይሰተይ፡ በከመ ይቤ መጽሓፍ አፍላገ ማየ ሕይወት
ዘይዉኅዝ እምከርሡ፡ ወልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ
ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('3. ቀዲሙ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
3. ቀዲሙ ዜነወነ አብ በየውጣ እንተ ይእቲ ዐሠርቱ ቃላት እለ ተጽሕፋ
በአፃብዒሁ ለእግዚአብሔር፡ ወመሀረነ ወልድከ እግዚእነ ወመድኃኒነ
ኢየሱስ ክርስቶስ፡ ከመ አንተ ባሕቲትከ አቡሁ ሎቱ ወውእቱ
ባሕቲቱ ወልድ ለከ፡ ከመዝ ነአምን ዘአልቦቱ እም በሰማያት፡ ወአብ
በዲበ ምድር፡ ዘወረደ እምሰማያት እንዘ አልቦ ዘየአምር ምጽአቶ
ዘእንበለ አቡሁ ባሕቲቱ ወጴራቅሊጦስ መንፈሰ ጽድቅ፡ ኀደረ ዉስተ
ከርሥኪ ወፆርኪዮ ተስዐተ አውራኀ፡ ተፈሥሑ ሰማያት ወተኃሥየት
ምድር በልደቱ ለወልድኪ፤ መልአክ ዜነወ ፍሥሓ ወሓራ ሰማይ ሰብሑ እንዘ ይብሉ ''ስብሓት
ለእግዚአብሔር በሰማያት፡ ወሰላም በምድር ለዕጓለ እመሕያዉ
ሥምረቱ'' ወኖሎት በቤተልሔም አንከሩ እምዘርእዩ ወሰምዑ፡ ሰብአ
ሰገል ርእዮሙ ኮከበ መጽኡ እምርኁቅ ብሔር ከመ ይሰግዱ
ለወልድኪ ወይግነዩ ለኪ፡ ውእቱ ኮከብ ዘመርሖሙ እምሥራቅ
ወአብጽሖሙ እስከ ቤተልሔም ወቆመ መልዕልቴኪ ኀበ ሀሎኪ
አንቲ ምስለ ሕፃንኪ፡ ወርእዮሙ እሙንቱ መሰግላን ተፈሥሑ ዐብየ ፍሥሓ፡ ቦኡ ኀቤሁ ወቆሙ ቅድሜሁ
ወወድቁ ዲበ ምድር ወሰገዱ ሎቱ፡ ወአርኀዉ መዛግብሆሙ።
ወአብኡ ሎቱ አምኃ ወርቀ፡ ከርቤ፡ ወስኂነ፡ ወይቤሉ አምኃ
አባእነ ለከ፡ ዕጣነ አቅረብነ ለከ፡ እምዚአከ ለክቡር ስምከ፡ ኦ
አምላክነ በእንተ ኃጢአተ ሕዝብከ ከመ ትትወከፍ ስእለቶሙ
ወመሥዋዕቶሙ ዘመጻእከ ከመ ትሥረይ ሎሙ ኃጢአቶሙ፡
ወልድኪ ሣህሎ ይክፍለነ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('4. ንጽሕት'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
4. አንቲ ዉእቱ ንጽሕት እምንጹሓን፡ድንግል ሕሩይ ዘነበርኪ ውስተ ቤተ መቅደስ
ከመ ታቦት ዘግቡር እምዕፅ ዘኢይነቅዝ፡ ሥርግዉ በወርቅ ንጡፍ ወልቡጥ
በዕንቊ ባሕርይ ዘየኃቱ ዘብዙኅ ሤጡ፡ከመዝ ነበርኪ ዉስተ ቤተ መቅደስ፡
ወመላእክት ያመጽኡ ወትረ ሲሳየኪ፡ ከመዝ ነበርኪ ዐሠርተ ወክልኤተ ዓመተ
እንዘ ትትናዘዚ እምኀበ መላእክት ስቴኪኒ ስቴ ሕይወት ዉእቱ። መብልዕኪኒ
ኅብስት ሰማያዊ፡ ዳዊት አቡኪ ዘመረ በመሰንቆ ወኀለየ �በመዝሙር እንዘ ይብል
በመንፈሰ ትንቢት፡ ስምዒ ወለትየ ወርእዩ ወአፅምዒ እዝነኪ፤ ርስዒ ሕዝበኪ
ወቤተ አቡኪ እስመ ፈተወ ንጉሥ ሥነኪ፡ እስመ ዉእቱ እግዚእኪ ወሎቱ
ትሰግዲ፡ ወልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),

        ExpansionTile(
          title: Text('5. ገብርኤል '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
5. ገብርኤል መልአክ እመላእክት ንጹሓን ዘአልቦ ሙስና፡ እመላእክት
ቀደምት ዘይቀዉም ቅድመ እግዚአ ኩሉ አብሠረኪ ወይቤለኪ ተፈሥሒ
ፍሥሕት ኦ ምልእተ ጸጋ እግዚአብሔር ምስሌኪ ቡርክት አንቲ እምአንስት
ረከብኪ ሞገሰ በኀበ �እግዚአ ኩሉ ወናሁ ትፀንጺ ወትወልዲ ወልደ፡ ወትሰምዪዮ
ስሞ ኢየሱስ፡ ዉእቱ ዓቢይ ወይሰመይ ወልደ እግዚአብሔር ልዑል ወይሁቦ
እግዚአብሔር አምላክ መንበረ ዳዊት አቡሁ፡ ወይነግሥ ለቤተ ያዕቆብ ለዓለም፡
ወአልቦ ማኅለቅት ለመንግሥቱ፡ መንፈስ ቅዱስ ይመጽእ ላዕሌኪ፡ ወኃይለ ልዕል
ይጸልለኪ፡ ዘኒ ይትወለድ እምኔኪ፡ ቅዱስ ዉእቱ ወይሰመይ ወልደ እግዚአ ኩሉ
ዘተወልደ እምኔኪ፤ ወልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('6. ዘኮንኪ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
6. አንቲ ዉእቱ ዘኮንኪ ጽርሐ ቅድሳት ወመቅደሰ ቅድስተ
ቅዱሳን ወመንጦላዕተ ብርሃን፡ ወመንበረ ስብሐት
ዘኢይተረጎም፡ አስተማሰልናኪ ኦ ቅድስት ማርያም በመቅደሰ
ቅድስተ ቅዱሳን፡ በእንተ ቅዱስ መንፈስ ዘመጽአ ላዕሌኪ፡
ወኃይለ ልዑል ጸለለኪ፡ ወመንጦላዕተ ብርሃንሰ በእንተ
ዘተሠወረ ቃለ አብ ኢየሱስ ክርስቶስ መድኃኒነ ዉስተ
ከርሥኪ፡ እግዚአ ኩሉ ዘመልዕልት፡ ዘይሴብሕዎ መላእክት
ወሊቃነ መላእክት አጋአዝት ወሥልጣናት ኃይላት ወመናብርት ወመኳንንት። ወሶበ
ወለድኪ ወልደኪ በዲበ ምድር በውስተ ጎል ከለሉኪ ኪሩቤል እለ
ብዙኃት አዕንቲሆሙ፡ ወሱራፌል እለ ስድስቱ ክነፈሆሙ፡ ወደመናተ
ብርሃን ፆርኪ፡ሊቃነ መላእክት ወሠራዊተ መላእክት ወሐራ ሰማይ ቆሙ
ቅድሜኪ በፍርሃት ወበረዓድ፡ ወበህየ በካልእ ስብሐት ወደሱኪ ኪሩቤል
ወሱራፌል ዘኢኮነ እምስብቲሆሙ ዘዉስተ ሰማያት ወኢእምስብሐቲሆሙ ዘትካት፣ ወሶበ ርእዩ እግዚኦሙ ዘአስተጋብአ ኩሎ
ፍጥረታት እንዘ ይነብር ዉስተ ኅፅንኪ፡ ወዘይሴሲ ለኩሉ ፍጥረት ይጠቡ
ሐሊበኪ ከመሕፃን፡ ኅሠሥዎ ውስተ አርያም ወበህየ ረከብዎ ምስለ
አቡሁ ወመንፈስ ቅዱስ ከመ ትካት፡ ወሶበ ርእዩ ትሕትናሁ ለእግዚኦሙ አልዐሉ አዕይንቲሆሙ ላዕለ ውስተ አርያም፡
ሰፍሑ ክነፈሆሙ ወሰብሑ ለእግዚኦም እንዘ ይብሉ ስብሐት ለከ እግዚአ ኩሉ
በሰማያት፡ ወዓዲ ርአዩኪ በውስተ በዓት ለኪ ለባሕቲትኪ ምስለ ሕፃንኪ
ወይቤሉ ሰላም በዲበ ምድር፡ ወሶበ ርእዩ እንዘ ይለብስ ሥጋ ዚአነ ዘነሥአ
እምኔኪ ሰገዱ እንዘ ይብሉ ለዕጓለ እመሕያዉ ሠምሮ። ዳዊት ነቢይ ተነበየ
በመዝሙር እንዘ ይብል፡ እምሰማይ ሐወፀ እግዚአ ኩሉ ወእምድልዉ ጽርሐ
መቅደሱ፡ ወርእየ ኩሎ ደቂቀ ዕጓለ እመሕያዉ፡ ፈተወ ንጉሥ ሥነኪ ወይቤ
ዛቲ ይእቲ ምዕራፍየ ለዓለም፡ ዝየ አኃድር እስመ ኀረይክዋ፡ ወልድኪ ሣህሎ
ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('7. አስተማሰልናኪ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
7. አስተማሰልናኪ ቅድስት ወብፅዕት፤ ስብሕት ወቡርክት፡ ክብርት ወልዕልት
በመሶበ ዘወርቅ፡ ዘውስቴታ ኅብስተ ሕይወት ዘወረደ እምሰማያት፡ ወሀቤ
ሕይወት ለኩሉ፡ ዘየአምን ኪያሁ ወይበልዕ እምኔሁ በአሚን ወበልብ ሥሙር
ምስለ እለ በየማኑ። ውልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('8. ተቅዋም ዘወርቅ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 8. አንቲ ዉእቱ ተቅዋም ዘወርቅ ዘኢገብራ እደ ኬንያ ዘሰብእ፡ ወኢያኃትዉ
ዉስቴታ ማኅቶተ፡ አላ ለሊሁ ብርሃን አብ፡ ብርሃን ዘእምብርሃን፡ መጽአ ኀቤኪ
ወነበረ መልዕልቴኪ፡ ወአብርሀ መለኮቱ ወስተ ኩሉ አጽናፈ ዓለም፡ ሰደደ
ጽልመተ እምላዕለ ሰብእ፡ ወአድኃነነ ብቃሉ ማሕያዊ እንዘ ይብል፡ አነ ዉእቱ
ብርሃኑ ለዓለም፡ እመኑ በብርሃኑ ወአንሶስዉ እንዘ ብክሙ ብርሃን፡ ወልድኪ
ሣህሎ ይክፍለነ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('9. እግዚአ ኩሉ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
9. እግዚአ ኩሉ ዘእም እግዚአ ኩሉ፡ ብርሃን ዘእምብርሃን፡ እግዚእ
ዘበአማን፡ ዘእምእግዚአ ኩሉ ዘበአማን፡ ዘተወልደ ወአኮ ዘተገብረ፡
ኅቡር ህላዌሁ ምስለ አቡሁ ዘቦቱ ኩሉ ኮነ፡ ዘበሰማይኒ
ወበዘምድርኒ። ዘበእንቲአነ ለሰብእ ወበእንተ መድኃኒትነ ወረደ
ወተሠገወ ወተሠብአ እማርያም እምቅድስት ድንግል፡ ወበምጽአቱ
አብርሀ ላዕሌነ ወዜነወነ ትፍሥሕተ ወኃሤተ ወአቅወኃሤተ ኀበ
አቡሁ ወመርሐነ ፍኖተ ሕይወት ወወሀበነ ሕይወት ዘለዓለም
በአሚነ ዙአሁ። ኢሳይያስ ነቢይ እምትእዛዙ ለኢየሱስ አንከረ በትንቢት ወይቤ፡ ብርሃን ትእዛዝከ በዲበ ምድር።
ዘካርያስ ካህን አንከረ በትንቢት ወይቤ፡ ብርሃን ትእዛዝከ በዲበ ምድር።
ዘካርያስ ካህን አረጋዊ ጻድቅ ወንጹሕ ዘይገብር ትእዛዙ
ለእግዚአ ኩሉ፡ አንከረ ወቀደመ፡ ከሠተ አፉሁ ወይቤ፡
በሣህሉ ወበምሕረቱ ለአምላክነ ለዘሐወፀነ እምአርያም፡
ወሠረቀ ከመ ያርእዮሙ ብርሃኖ ለእለ ይነብሩ ዉስተ
ጽልመት ወጽላሎተ ሞት፡ ወአርትዐ እገሪነ ዉስተ ፍኖተ
ሰላም ከመ ይምሓረነ፡ ወልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ
ቅድስት።                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('10. ናስተማስለኪ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 10. ናስተማስለኪ ኦ እግእትነ በማዕጠንት ዘወርቅ ዘዉሰተ እዲዊሆሙ
ለሊቃነ ካህናት ሰማያዉያን እለ ይከውኑ ጸሎተ ኩሎሙ ቅዱሳን
መሃይማናን እምዲበ ምድር በዉስተ ማዕጠንቶሙ ከማሁ በሲለተ ስምኪ
ያዐርጉ ስእለቶሙ ለዕጓለ ዕመሕያዉ ዉስተ ማኅደረ ሥሉስ ቅዱስ አብ
ወወልድ ወመንፈስ ቅዱስ፡ ወታስተሥርዩ ኃጢአተ ሕዝብኪ ተበውሐ
ለኪ ኢምአብ ወወልድ ወመንፈስ ቅዱስ፡ ከመ ትኩኒ ተንከተመ ለዉሉደ
ሰብእ ለሕይወት ዘለዓለም፡ ለኪ ይደሉ ከመ ትኩኒ መድኃኒቶሙ
ለማሃይምናን ሕዝብኪ ኦ መድኃኒተ ኩሉ ዓለም፡ ወልድኪ ሣህሎ
ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('11. ዕፅ ቡሩክ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 11. አንቲ ዉእቱ ዕፅ ቡሩክ፡ ዕፅ ሕይወት ወዕፀ መድኃኒት
ህየንተ ዕፀ ሕይወት ዘውስተ ገነት፡ ዘኮንኪ ዕፀ ሕይወት
በዲበ ምድር። ፍሬኪኒ ፍሬ ሕይወት ዉእቱ፡ ወዘበልዐ
እምኔሁ ሕይወተ ዘለዓለም የሓዩ። ጽጌ አስተርአየ እምኔኪ፡
ዘሠናየ መዓዛ ይምዕዝ በኀበ እለ የአምርዎ ዉስተ ኩሉ
አጽናፈ ዓለም፡ ዘበእንቲአሁ ተነበየ ዳዊት በመዝሙር እንዘ
ይብል፡ ከርቤ ወሚዓ ወሰሊክ እምነ አልባስኪ፡ ሰሎሞን አብኪ ተነበየ ወይቤ፡ ፄና አንፍኪ ከመ ፄና ስኂን፡
ገነት ዕፁት እኅትየ መርዓት፡ ገነት ዕፁት ዐዘቅት ኅትምት
ፍናወ ዚአኪ፡ ገነት ምስለ ፍሬ አቅማሕ፡ ቆዕ ምስለ ናርዶስ፡
ናርዶስ ዘምስለ መጽርይ ቀጺመታት ወቀናንሞስ ምስለ ኩሉ
ዕፀወ ሊባኖስ፡ ከርቤ ወዓልዉ ምስለ ኩሉ መቅድመ
ዕፍረታት፡ ነቅዐ ገነት ዐዘቅተ ማየ ሕይወት ዘይዉሕዝ
እምሊባኖስ፡ ወልድኪ ሣህሎ ይክፍለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('12. በትረ አሮን'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 12. በትረ አሮን እንተ ሠረፀት ዘእንበለ ተክል ወኢሠቀይዋ ማየ
በቤተ መቅደስ፡ ወረሰያ ድሉተ ለካህናት፡ ከማሃ አንቲኒ ነበርኪ
ዉስተ ቤተ መቅደስ በቅድስና ወበንጽሕ ወወፃእኪ እምቤተ መቅደስ
በክብር ወበዓቢይ ፍሥሓ፡ ወሠረፀ እምኔኪ ፍሬ ሕይወት ዘበአማን
እግዚእነ ወመድኃኒንነ ኢየሱስ ክርስቶስ፤ ኦ ቅድስት ዘእንበለ ሩካቤ
ረከብኪ ወልደ በከመ ተጠየቂዮ ለመልአክ ወይቤሌኪ፡ መንፈስ
ቅዱስ ይመጽእ ላዕለኪ ወኃይለ ልዑል ይጼልለኪ፡ ወልድኪ ሣህሎ
ይክፈለነ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('13. ለኪ ይደሉ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 13. ለኪ ይደሉ ለአግብርትኪ ወለአእማትኪ ትስአሊ ለነ ኀበ
ወልድኪ፡ ለእለ አመነ በስመ ወልድኪ፡ ኦ ምልእተ ጸጋ፡ ኦ ሙኃዘ
ፍሥ ሓ፡ ፈድፋደ ብኪ ግርማ ራእይ ዘየዐቢ እምኪሩቤል እለ
ብዙኃት አዕንቲሆም ወሱራፌል እለ ስድስቱ ክነፈሆም፡ እልክቱ
ይከድኑ ገጾሙ ወእገረሆሙ በአርአያ ትእምርተ መስቀል፡ ከመ
ይድኃኑ እምእሳት ዘይወፅእ እመለኮተ ወልድኪ፡ አንቲሰ ኮንኪ
ማኅፈደ ለመለኮት፡ ወኢያዉዐየኪ እሳተ መለኮት ፆርኪ ነበልባለ
እሳት፡ወኢያዉዐየኪ ነበልባለ መለኮት፡ ተመሰልኪ ዕፀ ጳጦስ ዘርእየ ሙሴ በነደ እሳት ወዕፀታ ኢዉዕየ፡ ከማሁ ኢያዉዐየኪ
እግዚአ ኃይላት ዘኩለንታሁ እሳት ፍጹም፡ አንቲ በአማን ዘኮንኪ ምክሐ ለዘመደ
ክርስቲያን። ወብኪ ቅሩባነ ኮነ እምድር ለማኅደር ዉስተ አርያም፡ በእንተ
ተሠግዎቱ ለወልደ አምላክ እምኔኪ ሰአሊት ለነፍሳቲነ ሕይወተ ኦ ጸጋዊተ
ምሕረት ለእለ የአምኑ በጸሎታ፡ ሰአሊ ለነ ኀበ እግዚእነ ወመድኃኔነ ኢየሱስ
ክርስቶስ ያጽንዐነ በርትዕት ሃይማኖት ዉስተ አሚነ ዚአሁ ወዘአቡሁ ወዘቅዱስ
መንፈሱ፡ ይጸግወነ ሣህሎ ወምሕረቶ ይሥረይ ኃጢአተነ በብዝኀ ምሕረቱ፡
ስብሐት ለኪ ኦ ወላዲተ እግዚአ ኪሉ አኮቴት ወክብር ለአብ ወወልድ ወመንፈስ
ቅዱስ፡ ይእዜኒ ወዘልፈኒ ወለዓለም ዓለም አሜን ወልድኪ ሣህሎ ይክፍለነ፡ሰአሊ
ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('14. ይዌድስዋ መላዕክት'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 † በእንተ ተሠግዎቱ ለወልደ አምላክ እምኔኪ፡ ወብኪ ቅሩባነ ኮነ እምድር
ለማኅደር ዉስተ አርያም፡ብኪ ወበስመ ወልድኪ ቅሩባነ ኮነ።

1. ይዌድስዋ መላእክት ለማርያም በዉስተ ዉሥጤ መንጦላዕት፡ ወይበልዋ
በሐኪ ማርያም ሐዳስዩ ጣዕዋ። ይቤላ መልአክ ለማርያም ተወከፈዮ
ለቃል ኅቤኪ ይመጽእ ወበማኅፀነ ዚአኪ የኅድር፡ እፎ ቤተ ነዳይ ኅደረ
ከመ ምስኪን እምሰማያት ወረደ ላዕሌሃ ፈቲዎ ሥነ ዚአሃ ወተወልደ
እምኔሃ።

2. ወበሳድስ ወርኅ ተፈነወ ገብርኤል መልአክ እምኅበ እግዚአብሔር ኀበ
አሐቲ ሀገር ዘገሊላ እንተ ስማ ናዝሬት ኀበ ድንግል እንተ ተፍኅረት
ለብእሲ ዘስሙ ዮስፍ ዘእምቤተ ዳዊት፡ ወስማ ለይእቲ ድንግል ማርያም፡
ቦአ መልአክ ኀቤሃ ወይቤላ ተፈሥሒ ፍሥሕት ኦ ምልእተ ጸጋ
እግዚአብሔር ምስሌኪ፡ ብርክት አንቲ እምአንስት ወርእያ ደንገፀት
እምቃሉ ወሐለየት ወትቤ፡ እፎኑ ከመዝኑ እንጋ አምኃ ይትአምኁ ወይበላ
መልአክ ኢትፍርሂ እስመ ረከብኪ ሞገሰ በኀበ እግዚአብሔር ወናሁ
ትፀንሲ ወትወልዲ ወልደ ወትሰምዪዮ ስሞ ኢየሱስ ዉእቱ ዐቢይ
ወይትሰመይ ወልደ እግዚአብሔር የኢትዮጵያ ኦርቶዶክስ ተዋሕዶ ቤተ ክርስቲያን ሥርዓት ልዑል። ወይሁቦ እግዚአብሔር አምላክ መንበረ ዳዊት አቡሁ።ወይነግሥ
ለቤተ ያዕቆብ ለዓለም ወአልቦ ማኅለቅት ለመንግስቱ፡ ትቤሎ
ማርያም ለመልአክ እፎኑ ይከዉነኒ ዝንቱ እንዘ ኢየአምር ብእሴ
እፎኑ ይከዉነኒ አዉሥኣ መልአክ ወይቤላ መንፈሰ እግዚአብሔር
ቅዱስ ይመጽእ ላዕሌኪ ወኃይለ ልዑል ይጸልለኪ ዘኒ ይትወለድ
እምኔኪ ቅዱስ ዉእቱ ወይሰመይ ወልደ እግዚአብሔር ልዑል፡ ወናሁ
ኤልሳቤጥኒ እንተ እምአዝማድኪ ይእቲኒ ፀንሰት ወረክበት ወልደ
በልኅቃቲሃ ወበርሥኣቲሃ ፡ ወናሁ ሳድስ ዝንቱ ወርኅ ለእንተ ይብልዋ መካን እስመ አልቦ ነገር ዘይሰአኖ
ለእግዚአብሔር፡ ትቤሎ ማርያም ለመልአክ ነየ አመቱ ለእግዚአ ኩሉ ነየ
አመቱ።ይኩነኒ በከመ ትቤለኒ።

3. ይቤላ መልአክ ሰላም ለኪ፡
ይቤላ ገብርኤል ሰላም ለኪ፡
ማርያም ድንግል ሰላም ለኪ፡
ወላዲተ አምላክ ሰላም ለኪ፡
ማርያም ቅድስት ሰላም ለኪ፡
ማርያም ዉድስት ሰላም ለኪ፡
ማርያም ፍሥሕት ሰላም ለኪ፡
 ማርያም ብፅዕት ሰላም ለኪ፡
 ማርያም ቡርክት ሰላም ለኪ፡
 ማኅደረ መለኮት ሰላም ለኪ፡
 ደብተራ ፍጽምት ሰላም ለኪ፡
 እኅተ መላእክት ሰላም ለኪ፡
 ወእመ ኩሉ ሕዝብ ሰላም ለኪ፡
 እግዚእትነ ማርያም ሰላም ለኪ፡
 ሰላማዊት ሰላም ለኪ፡
 ቀደሰኪ ለማህደሩ ልዑል ሰላም ለኪ89፡
አብደረኪ ወኅረየኪ ከመ ትኩኒዮ ማኅደሮ ሰላም ለኪ፡
በአልባሰ ወርቅ ዑፅፍት ወኁብርት ሰላም ለኪ።
ክንፈ ርግብ በቡሩር ዘግቡር ሰላም ለኪ፡
ወገበዋቲሃኒ በሐመልማለ ወርቅ ማርያም ሥርጉት ሰላም ለኪ፡
ኆኅተ ምሥራቅ ወእሙ ለብርሃን ሰላም ለኪ፡
ትበርሂ እምፀሓይ ወትትሌዐሊ እምአድባር ሰላም ለኪ፡
የኢትዮጵያ ኦርቶዶክስ ተዋሕዶ ቤተ ክርስቲያን ሥርዓት 90
ማርያም ኅርት ወክብርት ሰላም ለኪ፡
† ሰአሊ ለነ ኀበ እግዚእነ ወመድኃኒነ ኢየሱስ ክርስቶስ፡ ከመ
ያድኅነነ እመ ይመጽእ በስብሐተ አቡሁ ምስለ መላእክቲሁ
ቅዱሳን፡ እመ ያቀዉም አባግዐ በየማኑ ወአጣሌ በፀጋሙ፡
ያቁመነ በየማኑ ምስለ እስጢፋኖስ ሰማዕት ወዮሓንስ
መጥምቅ።ወምስለ ኩሎሙ ቅዱሳን ወሰማዕት ለዓለመ ዓለም
አሜን።

ጸሎታ ለማርያም ወስእለታ ያድኅነነ እመዓተ
ወልዳ፡ጸሎታ ለማርያም ወስእለታ ለርእሰ ሊቃነ ጳጳስነ
እገሌ……ይዕቀቦ እመዓተ ወልዳ፡ ጸሎታ ለማርያም
ወስእለታ ለመፍቀሬ አምላክ…….ይዕቀቦሙ እመዓተ
ወልዳ፡ ጸሎታ ለማርያም ወስእለታ ለሕዝበ ክርስቲያን
ይዕቀቦሙ እመዓተ ወልዳ፡ ጸሎታ ለማርያም ወስእለታ
ለሀገሪትነ ኢትዮጵያ ይዕቀቦሙ እመዓተ ወልዳ።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('9. ለኪ ይደሉ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
9. ለኪ ይደሉ ዘእምኩሎሙ ቅዱሳን ተስአሊ ለነ ኦ ምልእተ ጸጋ አንቲ
ተዐብዪ እምሊቃነ ጳጳሳት ወፈድፋደ ትከብሪ እምነቢያት ብኪ ግርማ
ራእይ ዘየዐቢ እምግርማ ሱራፌል ወኪሩቤል፡ አንቲ በአማን ምክሐ
ዘመድነ ወሰአሊት ሕይወተ ለነፍሳቲነ ሰአሊ ለነ ኀበ እግዚእነ
ወመድኃኒነ ኢየሱስ ክርስቶስ፡ ያፅንዐነ በርትዕት ሃይማኖት ዉስተ
አሚነ ዚአሁ፡ ይጸግወነ ሣህሎ ወምሕረቶ፡ ይሥረይ ኃጢአተነ
በብዝኃ ምሕረቱ፡ ሰአሊ ለነ ቅድስት።

ወበእንተዝ ናዓብየኪ ኩልነ ኦ እግዝእትነ ወላዲተ አምላክ
ንጽሕት ኩሎ ጊዜ፡ ንስእል ወናንቀዐዱ ኀቤኪ ከመ ንርከብ
ሣህለ በኀበ መፍቀሬ ሰብእ። 

ጸሎታ ለማርያም ወስእለታ ያድኅነነ እመዓተ ወልዳ።
ጸሎታ ለማርያም ወስእለታ ለርእሰ ሊቃነ ጳጳስነ እገሌ ……….ይዕቀቦሙ እመዓተ ወልዳ። 
ጸሎታ ለማርያም ወስእለታ ለመፍቀሬ አምላክ እገሌ…………… እዕቀቦሙ እመዓተ ወልዳ። 
ጸሎታ ለማርያም ወስእለታ ለሕዝበ ክርስትያን ይዕቀቦም እብመዓተ ወልዳ። 
ጸሎታ ለማርያም ወስእለታ ለሀገረትነ ይዕቀባ እመዓተ ወልዳ።
                '''),
            ),
          ],
        ),
      ],
    );
  }
}
