import 'package:flutter/material.dart';

class Thursday extends StatelessWidget {
  const Thursday({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('ውዳሴ ማርያም ዘሐሙስ')),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: WidaseMaryamContent(),
      ),
    );
  }
}

class WidaseMaryamContent extends StatelessWidget {
  const WidaseMaryamContent({super.key});

  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        ExpansionTile(
          title: Text('1. ዉዳሴ ማርያም ዘኃሙስ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ አምላክ ዘይትነበብ
በዕለተ ኃሙስ።
1. ዕፀ እንተ ርእየ ሙሴ በነደ እሳት ዉስተ ገዳም ወአዕፁቂሃ
ኢትዉዒ፡ ትመስል ማርያም ድንግል ዘእንበለ ርኩስ ተሰብአ እምኔሃ
ቃለ አብ፡ ወኢያዉዐያ እሳተ መለኮቱ ለድንግል፡ እምድኅረ ወለደቶ
ድንግልናሃ ተረክበ፡ ወመለኮቱ ኢተወለጠ ኮነ ወልደ ዕጓለ
እመሕያዉ አምላክ ዘበአማን መጽአ ወአድኃነነ፡ ሰአሊ ለነ ቅድስት።

               '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('2. ትምክሕተ ኩልነ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 2. ናዐብየኪ ኩልነ ኦ እግዝእትነ ወላዲተ አምላክ እስመ ሣህልኪ ይኩን ላዕለ ኩልነ።ትምክሕተ ኩልነ ድንግል ማርያም ወላዲተ
አምላክ ዘበእንቲአሃ ተሥዕረ ዘቀዳሚ መርገም እንተ ኃደረት ዲበ ዘመድነ፡ በዕልወት ዘገብረት ብእሲት በልዐት እምዕፅ፡ በእንተ ሔዋን
ተዐፅወ ኆኅተ ገነት፡ ወበእንተ ማርያም ድንግል ተርኅወ ለነ ዳግመ፡ ከፈለነ ንብላዕ እምዕፀ ሕይወት፡ ዘዉእቱ ሥጋሁ ለክርስቶስ ወደሙ
ክቡር፡ በእንተ ፍቅረ ዚአነ መፅአ ወአድኃነነ፡ አይ ልቡና፡ ወአይ ነቢብ፡ ወአይ ሰሚዕ፡ ዘይክል አእምሮ ዝንቱ ምሥጢር መንክራተ
ዘይትነበብ ላዕሌሃ፡ እግዚአብሔር መፍቀሬ ሰብእ ፩ዱ ዉእቱ ባሕቲቱ ቃለ አብ ዘሀሎ እምቅድመ ዓለም በመለኮቱ፡ እንበለ ሙስና እም፩ዱ አብ መጽአ ወተሰብአ ወልድ ዋሕድ
እምቅድስት እሙ፡ እምድኅረ ወለደቶ ኢማሰነ ድንግልናሃ፡ ወበእንተዝ ግህደ ኮነት ከመ ወላዲተ ኣምላክ ይእቲ፡ ኦ ዕሙቅ ብዕለ
ጥበቡ ለእግዘአብሔር ከርሥ ዘፈትሐ ላዕሌሃ ትለድ በፃዕር ወሕማም ወኃዘነ ልብ፡ወኮነት ፈልፈለ ሕይወት ወወለደት ዘእንበለ ዘርአ ብእሲ
ዘይስዕር መርገመ እምዘመድነ። ወበእንተዝ ንሰብሖ እንዘ ንብል ስብሐት ለከ ኦ መፍቀሬ ሰብእ ኄር ወመድኃኔ ነፍሳቲነ፡ ሰአሊ ለነ
ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('3. ወዕፁብ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 3. ኦ ዝ መንክር ወዕፁብ ኃይለ ከርሣ ለድንግል ወላዲተ አምላክ
ዘእንበለ ዘርእ ስምዐ ኮነ መልአክ ዘአስተርአዮ ለዮሰፍ እንዘ ይብል
ከመዝ፡ እስመ ዘይትወለድ እምኔሃ እመንፈስ ቅዱስ ቃለ
እግዚአብሔር ዉእቱ ተሰብኣ ዘእንበለ ዉላጤ፡ ወለደቶ ማርያም
ምክዕቢተ ዝንቱ ፍሥኃ፡ ወይቤ ትወልዲ ወልደ ወይሰመይ
አማኑኤል ዘበትርጓሜሁ እግዚኣብሔር ምስሌነ፡ ወዓዲ ይሰመይ
ኢየሱስሃ ዘያድኅኖሙ ለሕዝቡ እምኃጢአቶሙ ያድኅነነ በኃይሉ
ወይሥረይ ኃትጥያተነ እስመ ጥዩቀ አእመርናሁ ከመ አምላክ ዉእቱ፡ ዘኮነ ሰብአ ሎቱ ስብሐት እስከ ለዓለም፡ ኦዝ መንክር ልደተ አምላክ
እማርያም እምቅድስት ድንግል፡ ኣግመረቶ ለቃል ኢቀደሞ ዘርእ
ለልደቱ ወኢአማሰነ በልደቱ ድንግልናሃ፡ እምኀበ አብ ወፅአ ቃል
ዘእንበለ ድካም፡ ወእምድንግል ተወልደ ዘእንበለ ሕማም፡ ሎቱ ሰገዱ
ሰብአ ሰገል፡ አምጽኡ ዕጣነ ከመ ኣምላክ ዉእቱ፡ ወርቀ እስመ ንጉሥ
ዉእቱ፡ ወከርቤ ዘይትወሀብ ለሞቱ ማሕየዊ በእንቲኣነ ተወክፈ
በፈቃዱ፡ አሀዱ ዉእቱ ባሕቲቱ ኄር ወመፍቀሬ ሰብእ፡ ሰአሊ ለነ
ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('4. ነሥአ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
 4. ኦዝ መንክር ነሥአ አሐደ ዐፅመ እምገቦሁ ለአዳም ወለሐኰ እምኔሁ
ብእሲተ ወኩሎ ፍጥረተ ዕጓለ እመሕያዉ፡ ተዉህበ እግዚእ ቃለ አብ ተሰብአ
እምቅድስት ድንግል ወተሰምየ ኣማኑኤል ወበእንተዝ ንስአል ኀቤሃ ኩሎ ጊዜ ከመ
ታስተሥሪ በእንቲአነ ኀበ ፍቁር ወልዳ፡ ኄርት ይእቲ በኀበ ኩሎሙ ቅዱሳን
ወሊቃነ ጳጳሳት እስመ ኣምጽአት ሎሙ ዘኪያሁ ይጸንሑ፡ ወለነብያትኒ ኣምጽአት
ሎሙ ለዘበእንቲኣሁ ተነበዩ፡ ወለሐዋሪያትኒ ወለደት ሎሙ ዘሰበኩ በስሙ ዉስተ
ኩሉ ኣጽናፈ ዓለም፡ ለሰማዕት ወለመሃይምናን ወፅአ እምኔሃ ዘተጋደሉ በእንቲአሁ
ክርስቶስ ብዕለ ጸጋ ጥበቡ ዘኢይትዐወቅ፡ንኅሥሥ ዕበየ ሣህሉ መጽአ ወአድኃነነ፡
ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),

        ExpansionTile(
          title: Text('5. መሐለ '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
5. መሐለ እግዚኣብሔር ለዳዊት በጽድቅ ወኢይኔስሕ፡ እስመ እምፍሬ ከርሥከ አነብር ዲበ መንበርከ፡ወሶበ
ተወክፎ ዉእቱ ጻድቅ ከመ እምኔሁ ይትወለድ ክርስቶስ በሥጋ፡ ፈቀደ ይኅሥሥ ወይርከብ ማኅደሮ ዘእግዚአብሔር ቃል ወፈጸመ ዘንተ በዐቢይ ትጋህ፡
ወእምዝ ጸርሐ በመንፈስ ወይቤ፡ ናሁ ሰማዕናሁ በኤፍራታ ወማኅደሮ ለአምላከ ያዕቆብ፡ እንተ ይእቲ ቤተልሔም ዘኀረያ አማኑኤል ይትወለድ ዉስቴታ
በሥጋ ለመድኃኒተ ዚአነ፡ ካዕበ ይቤላ ካልእ እምነብያት ወአንቲኒ ቤተልሔም ምድረ ኤፍራታ ኢትቴሐቲ እምነገሥተ
ይሁዳ፡ እስመ እምኔኪ ይወፅእ ንጉሥ ዘይርዕዮሙ ለሕዝብየ እስራኤል፡ ኦዝ ነገር ለእሉ እለ ተነበዩ ዘበአ፩ዱ መንፈስ
በእንተ ክርስቶስ ሎቱ ስብሓት፡ ምስለ ኄር አቡሁ፡ ወመንፈስ ቅዱስ እምይእዜ ወእስከ ለዓለም፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('6. ዳዊት'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
6. ዳዊት ዘነግሠ ለእስራኤል አመ ይትነሥኡ ላዕሌሁ ዕልዋን። ፈትወ ይስተይ ማየ እምዓዘቅተ ቤተልሔም፡ ፍጡነ ተንሥኡ
መላሕቅተ ሐራሁ ወተቃተሉ በዉስተ ትዕይንተ ዕልዋን፡ ወአምጽኡ ሎቱ ዉእተ ማየ ዘፈተወ ይስተይ፡ወሶበ ርእየ ዉእቱ ጻድቅ ከመ
አጥብዑ ወመጠዉ ነፍሶሙ ለቀትል በእንቲ አሁ፡ ከዐወ ዉእተ ማየ ወኢሰትየ እምኔሁ፡ ወእምዝ ተኈለቈ ሎቱ ጽድቅ እስከ ለዓለም፡
አማን መነኑ ሰማዕት ጣዕማ ለዛ ዓለም ወከዓዉ ደሞሙ በእንተ እግዚኣብሔር ወተዐገሡ ሞተ መሪረ በእንተ መንግሥተ ሰማያት፡ ተሣሃለነ በከመ ዕበየ ሣህልከ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('7. ኣሐዱ '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
7. ኣሐዱ ዘእምቅድስት ሥላሴ፤ ርእዮ ትሕትናነ አጽነነ
ሰማየ ሰማያት፡ መጽአ ወኀደረ ዉስተ ከርሠ ድንግል፡
ወኮነ ሰብአ ከማነ ዘእንበለ ኃጢአት ባህቲታ፡ ወተወልደ
በቤተ ልሔም በከመ ሰበኩ ነቢያት፡ አድኃነነ ወቤዘወነ
ወረሰየነ ሕዝበ ዚአሁ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
      ],
    );
  }
}
