import 'package:flutter/material.dart';

class Wednsday extends StatelessWidget {
  const Wednsday({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('ውዳሴ ማርያም ዘረቡዕ')),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: WidaseMaryamContent(),
      ),
    );
  }
}

class WidaseMaryamContent extends StatelessWidget {
  const WidaseMaryamContent({super.key});

  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        ExpansionTile(
          title: Text('ውዳሴ ማርያምን ከመ ድገምዎ በፊት ይህንን ይበሉ!!!'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text(
                '''
ኦ እግዚእትየ ፍትኅኒ እማይሰሩ ለሰይጣን እሙ ለመድኅን
ወለተ ብርሃን ባርኪኒ ቀድስኒ ወአንፅኅኒ በከመ ባርክዮ
ለቅዱስ ኤፍሬም ፍቁርኪ በረከተ ፍቁር ወልድኪ ወአቡሁ
ወመንፈስ ቅዱስ ይኅድር በላዕሌየ ።
                ''',
                style: TextStyle(fontSize: 16, height: 1.6),
                textAlign: TextAlign.justify,
              ),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('1. ዉዳሴ ማርያም ዘረቡዕ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
ዉዳሴሃ ፡ ለእግዝእትነ ፡ ማርያም ፡ ድንግል ፡ ወላዲተ ፡ ኣምላክ ፡ ዘይትነበብ ፡
በዕለተ ፡ ረቡዕ።
1. ኲሉ ፡ ሠራዊተ ፡ ሰማያት ፡ ይብሉ ፡ ብፅዕት ፡ አንቲ ፡ ሰማይ ፡ ዳግሚት ፡ ዲበ
፡ ምድር ፡ ኆኅተ ፡ ምሥራቅ ፡ ማርያም ፡ድንግል፡ከብካብ ፡ ንጹሕ፡ ወመርዓ ፡
ቅዱስ። ነጸረ ፡ ኣብ ፡ እምሰማይ ፡ ወኢረከበ ፡ ዘከማኪ ፡ ፈነወ ፡ ዋሕዶ ፡
ወተሰብአ ፡ እምኔኪ ፡ ሰአሊ ፡ ለነ ፡ ቅድስት።
               '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('2. ተነበዩ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
2. ኩሉ ፡ ትዉልድ ፡ ያስተበፅዑኪ ፡ ለኪ ፡ ለባሕቲትኪ ፡ ኦ ፡ እግዝእትነ ፡
ወላዲተ ፡ ኣምላክ። ተነበዩ ፡ ላዕሌኪ ፡ ዐቢያተ ፡ ወመንክራተ ፡ ኦ ፡ ሀገረ ፡ እግዚኣብሔር ፡
እስከ ፡ ኮንኪ ፡ አንቲ ፡ ማኅደረ ፡ ለፍሡሐን ፡ ኲሎሙ ፡ ነገሥተ ፡
ምድር ፡ የሐዉሩ ፡ በብርሃንኪ ፡ ወአሕዛብኒ ፡ በፀዳልኪ ፡ ኦ ፡
ማርያም ፡ ኩሉ ፡ ትዉልድ ፡ ያስተበፅዑኪ ፡ ወይሰግዱ ፡ ለዘተወልደ
፡ እምኔኪ ፡ ወያዐብይዎ። ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('3. ኣንቲ ፡ ዘበአማን ፡ ደመና'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
3. ኣንቲ ፡ ዘበአማን ፡ ደመና ፡ እንተ ፡ ኣስተርአይኪ ፡ ለነ ፡ ማየ ፡
ዝናም ፡ ትእምርተ ፡ ዋሕዱ ፡ ረሰየኪ ፡ ኣብ ፡ መንፈስ ፡ ቅዱስ ፡
ኃደረ ፡ ላዕሌኪ ፡ ወኃይለ ፡ ልዑል ፡ ጸለለኪ ፡ ኦ ፡ ማርያም ፡ ኣማን
፡ ወልድኪ ፡ ቃለ ፡ ወልደ ፡ ኣብ ፡ ዘይነብር ፡ ለዓለም ፡ መጽአ ፡ ወአድኃነነ ፡ እምኃጢአት ፡
ዓብይ ፡ዉእቱ ፡ ክብር ፡ ዘተዉህበ ፡ ለከ ፡ ኦ ፡ ገብርኤል ፡ መልአክ ፡
ዜናዊ ፡ፍሡሐ ፡ ገጽ ፡ ሰበከ ፡ ለነ ፡ ልደተ ፡ እግዚእ ፡ ዘመጽአ ፡
ኃቤነ ፡ ወአብሠርካ ፡ ለማርያም ፡ ድንግል ፡ ዘእንበለ ፡ ርስሐት ፡
ወትቤላ ፡ ተፈሥሒ፡ ኦ ፡ምልእተ ፡ ጸጋ ፡ እግዚኣብሔር ምስሌኪ።
ሰኣሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('4. ረከብኪ ፡ ፀጋ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
4. ረከብኪ ፡ ፀጋ ፡ መንፈስ ፡ ቅዱስ ፡ ኃደረ ፡ ላዕሌኪ ፡ ወኃይለ ፡
ልዑል ፡ ጸለለኪ ፡ ኦ ፡ ማርያም ፡ አማን ፡ ወለኪ ፡ ቅዱስ ፡ መድሓኑ
፡ ለኩሉ ፡ ዓለም ፡ መጽአ፡ ወአድኃነነ። ሰኣሊ ለነ ቅድስት። 
                '''),
            ),
          ],
        ),

        ExpansionTile(
          title: Text('5. ግብረ ፡ ድንግል '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
5. ግብረ ፡ ድንግል ፡ ይሴብሕ ፡ ልሳንነ ፡ ዮም ፡ ንወድሳ ፡ ለ
ማርያም ፡ ወላዲተ ፡ አምላክ ፡ በእንተ ፡ ዘተወልደ ፡ እምኔሃ
፡ በሀገረ ፡ ዳዊት ፡ እግዚእነ ፡ ወመድኃኒነ ፡ ኢየሱስ ፡
ክርስቶስ ፡ ንዑ ፡ ኩልክሙ ፡ ኣሕዛብ ፡ ናስተብፅዓ ፡
ለማርያም ፡ እስመ ፡ ኮነት ፡ እመ ፡ ድንግል ፡ ወፅሙረ ፡
ተፈሥሒ ፡ ኦ ፡ ድንግል ፡ ንጽሕት ፡ እንተ ፡ አልባቲ ፡ ርኩስ
፡ ዘመጽአ ፡ ቃለ ፡ ኣብ ፡ ወተሰብአ ፡ እምኔሃ።
 ተፈሥሒ ፡ ኦ ፡ ሙዳይ ፡ እንተ ፡ አልቦቲ ፡ ነዉር፡ ፍጽምት ፡
ዘአልባ ፡ ርስሐት። ተፈሥሒ ፡ ኦ ፡ ገነት ፡ ነባቢት ፡ ማኅደሩ
፡ ለክርስቶስ ፡ ዘኮነ ፡ ዳግማይ ፡ ኣዳም ፡ በእንተ ፡ ኣዳም ፡
ቅዳሚ ፡ ብእሲ ፡ ተፈሥሒ ፡ ኦ ፡ ፀዋሪቱ ፡ ለዋሕድ ፡ ለዘኢ
ተፈልጠ ፡ እምኅፅነ ፡ አቡሁ ፡ ተፈሥሒ ፡ ኦ ፡ ከብካብ ፡
ንጹሕ ፡ ሥርግዉ ፡ በኩሉ ፡ ሥነ ፡ ስብሐት ፡ መጽአ ፡
ወተሰብአ ፡ እምኔኪ ፡ ተፈሥሒ ፡ ኦ ፡ ዕፀ ፡ ጳጦስ ፡ እንተ ፡
ኢያዉዓያ ፡ እሳተ መለኮት ፡ ተፈሥሒ ፡ ኦ ፡ አመት፡ ወእም ፡ ድንግል ፡ ወሰማይ ፡ ሰማያዌ
፡ እንተ ፡ ፆረት ፡ በሥጋ ፡ ዘይፄዐን ፡ ዲበ ፡ ኩሩቤል ፡
ወበእንተዝ ፡ ንትፈሣሕ ፡ ወንዘምር ፡ ምስለ ፡ መላእክት ፡
ቅዱሳን ፡ በፍሥኀ ፡ ወበኃሤት ፡ ወንበል ፡ ስብሐት ፡
ለእግዚአብሔር ፡ በሰማያት ፡ ወሰላም ፡ በምድር ፡ ሥምረቱ
፡ ለሰብእ ፡ እስመ ፡ ኪያኪ ፡ ሠምረ ፡ ዘሎቱ ፡ ክብር ፡
ወስብሐት። ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('6. የዐቢ ፡ ክብራ'),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
6. የዐቢ ፡ ክብራ ፡ ለማርያም ፡ እምኩሎሙ ፡ ቅዱሳን ፡ እስመ ፡
ድልወ ፡ ኮነት ፡ ለተወክፎ ፡ ቃለ ፡ አብ ፡ ዘይፈርህዎ ፡ መላእክት ፡
ወየአኩትዎ ፡ ትጉሃን ፡ በሰማያት ፡ ጾረቶ ፡ ማርያም ፡ ድንግል ፡
በከርሣ ፡ ይእቲ ፡ ተዐቢ ፡ እምኪሩቤል ፡ ወትፈደፍድ ፡ እምሱራፌል
፡ እስመ ፡ ኮነት ፡ ታቦት ፡ ለአኃዱ ፡ ዘእምቅድስት ፡ ሥላሴ ዛቲ ፡
ይእቲ ፡ ኢየሩሳሌም ፡ ሀገሮሙ ፡ ለነብያት ፡ ወማኅደረ ፡
ፍሥሐሆሙ ፡ ለኩሎሙ ፡ ቅዱሳን ፡ ሕዝብ ፡ ዘይነብር ፡ ዉስተ ፡
ጽልመት ፡ ወጽላሎተ ፡ ሞት ፡ ብርሃን ፡ ዐቢይ ፡ ሰረቀ ፡ ላዕሌኆሙ
:- እግዚኣብሔር ፡ ዘየዐርፍ ፡ በቅዱሳኒሁ ፡ ተሰብአ ፡ እምድንግል ፡
ለመድኃኒተ ፡ ዚአነ ፡ ንዑ ፡ ርእዩ ፡ ዘንተ ፡ መንክረ ፡ ወዘምሮ ፡
ዘምሩ ፡ በእንተ ፡ ምሥጢር ፡ ዘተከሥተ ፡ ለነ ፡ እስመ ፡
ዘኢይትሰባእ ፡ ተሰብአ ፡ ቃል ፡ ተደመረ ፡ ወዘአልቦ ፡ ጥንት፡ ኮነ ፡
ቅድመ ፡ ወለዘአልቦ ፡ መዋዕል ፡ ኮነ ፡ ሎቱ ፡ መዋዕል ፡
ዘኢይትዐወቅ ፡ ተከስተ ፡ ወኢይትረአይ ፡ ተራእየ ፡ ወልደ ፡
እግዚኣብሔር ፡ ሕያዉ ፡ ጥዩቀ ፡ ኮነ ፡ ሰብአ ፡ ኢየሱስ ፡ ክርስቶስ ፡
ዘትማልም ፡ ወዮም ፡ ወክመ ፡ ዉእቱ ፡ እስከ ፡ ለዓለም። ኣሓዱ ፡ ህላዌ ፡ ሎቱ ፡ ንስግድ
፡ ወንሰብሕ ፡ ሰአሊ ለነ ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('7. ሕዝቅኤል '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
7. ሕዝቅኤል ፡ ነቢይ ፡ ኮነ ፡ ስምዐ ፡ በእንቲኣሃ ፡ ወይቤ
፡ ርኢኩ ፡ ኆኅተ፡ በምስራቅ ፡ ኅቱም ፡ በዐቢይ ፡
መንክር ፡ ማኅተም ፡ ኣልቦ ፡ ዘቦአ ፡ ዘእንበለ ፡ እግዚኣ
፡ ኃያላን ፡ ቦአ ፡ ዉስቴታ ፡ ወወፅአ ፡ ሰአሊ ለነ
ቅድስት።
                '''),
            ),
          ],
        ),
        ExpansionTile(
          title: Text('8. ኆኅትሰ '),
          children: [
            Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
8. ኆኅትሰ ፡ ድንግል ፡ ይእቲ ፡ እንተ ፡ ወለደት ፡ ለነ ፡ መድኅነ ፡
እምድኅረ ፡ ወለደት ፡ ኪያሁ ፡ ነበረት ፡ በድንግልና ፡ ከመ ፡ ትካት።
ቡሩክ ፡ ዉእቱ ፡ ፍሬ ፡ ከርሥኪ ፡ ኦ ፡ ወላዲተ ፡ እግዚእ ፡ ዘመጽአ ፡
ወአድኃነነ እምእደ ጸላኢ ዘአልቦ ምሕረት፡ አንቲ ፡ ፍጽምት ፡ ወቡርክት ፡
ረከብኪ ፡ ሞገሰ ፡ በኀበ ፡ ንጉሠ ፡ ስብሐት ፡ አምላክ ፡ ዘበአማን ፡ ለኪ ፡
ይደሉ ፡ ዕበይ ፡ ወክብር ፡ እምኩሎሙ ፡ እለ ፡ ይነብሩ ፡ ዲበ ፡ ምድር ፡
ቃለ ፡ አብ ፡ መጽአ ፡ ወተሰብአ ፡ እምኔኪ ፡ ወአንሶሰወ ፡ ምስለ ፡ ሰብእ
። እስመ ፡ መሐሪ ፡ ዉእቱ ፡ ወመፍቀሬ ፡ ሰብእ ፡ አድኃነ ፡ ነፍሳቲነ ፡
በምጽአቱ ፡ ቅዱስ ፡ ሰአሊለነ ቅድስት።
                '''),
            ),
          ],
        ),
      ],
    );
  }
}
